{
  "services": [
    {
      "name": "LibPixel CDN",
      "status": "operational"
    },
    {
      "name": "LibPixel (us-east-1)",
      "status": "operational"
    },
    {
      "name": "LibPixel (eu-west-1)",
      "status": "operational"
    },
    {
      "name": "Dashboard",
      "status": "degraded"
    }
  ],
  "maintenance": [
    {
      "title": "Dashboard database upgrade",
      "date": "2016-02-07T14:00:00Z",
      "severity": "red",
      "resolved": true,
      "description": "We'll be upgrading our dashboard database which will cause it to be offline for a few minutes. Only the dashboard will be affected by this downtime. All image processing services will continue to operate uninterrupted.",
      "updates": [
        {
          "date": "2016-02-07T14:00:00Z",
          "status": "Started",
          "body": "The scheduled database maintenance has now started."
        },
        {
          "date": "2016-02-07T14:10:00Z",
          "status": "Finished",
          "body": "The scheduled database maintenance is now finished. The total downtime was 6 minutes, and only affected the Dashboard, not any image processing services."
        }
      ]
    }
  ],
  "incidents": [
    {
      "title": "Missing receipts in dashboard",
      "date": "2016-02-03T17:11:00Z",
      "description": "Some recent receipts were missing from the Billing page of the dashboard. All receipts are now available for download. There were no issues delivering receipts by email.",
      "resolved": true
    },
    {
      "title": "Dashboard down",
      "severity": "yellow",
      "date": "2016-07-22T21:15:00Z",
      "description": "Changes in configuration and code have resulted in a failed dashboard deployment which brought down the service. No image processing services are affected, and continue to operate normally.",
      "resolved": true,
      "updates": [
        {
          "date": "2016-07-22T21:33:00Z",
          "status": "Resolved",
          "body": "The dashboard is back online. We'll be improving our deployment system in the near future to prevent failed deployments from bringing the service down for this long."
        }
      ]
    },
    {
      "title": "Dashboard usage data incident",
      "severity": "yellow",
      "date": "2017-04-17T10:41:00Z",
      "description": "We've detected request timeouts on our dashboard and are investigating. Image serving is not affected in any way.",
      "resolved": true,
      "updates": [
        {
          "date": "2017-04-17T10:46:00Z",
          "status": "Issue identified",
          "body": "We've identified that our system that tracks customer usage is experience very degraded performance, causing request timeouts on our dashboard and usage alerts to not be sent in realtime."
        },
        {
          "date": "2017-04-17T11:10:00Z",
          "status": "Temporary fix",
          "body": "We've disabled usage reports until we can have the underlying system fixed."
        },
        {
          "date": "2017-04-17T22:33:00Z",
          "status": "Restoring unique usage data",
          "body": "We've re-engineered parts of our usage data store to perform better under high volumes of data. We've cleared all the unique usage data for the current month and are currently restoring it from logs."
        },
        {
          "date": "2017-04-17T23:09:00Z",
          "status": "Unique usage data restored",
          "body": "The unique requests in the dashboard are now all correct and up-to-date. Bandwidth and total request usage reports are still not up-to-date, and will be restored from logs within the next 24 hours."
        },
        {
          "date": "2017-04-18T12:57:00Z",
          "status": "All usage data restored",
          "body": "We've finished restoring the total request and bandwidth usage data. All data is now restored and the service is back to normal. Image serving was not affected in any way by this incident."
        }
      ]
    },
    {
      "title": "Incorrect usage data",
      "severity": "yellow",
      "date": "2017-04-27T10:38:00Z",
      "description": "A change made on the 17th of April has caused unique requests to be counted multiple times in some circumstances.",
      "resolved": false,
      "updates": [
        {
          "date": "2017-04-27T19:09:00Z",
          "status": "Issue fixed",
          "body": "After thorough testing, a fix was deployed to production. We've erased unique counters for all customers and are restoring them from logs."
        }
      ]
    }
  ]
}
